//============================================================
//
//	シェーダーマネージャーヘッダー [shaderManager.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _SHADERMANAGER_H_
#define _SHADERMANAGER_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "main.h"

//************************************************************
//	前方宣言
//************************************************************
class CBumpMap;	// バンプマッピングクラス

//************************************************************
//	クラス定義
//************************************************************
// シェーダーマネージャークラス
class CShaderManager
{
public:
	// コンストラクタ
	CShaderManager();

	// デストラクタ
	~CShaderManager();

	// メンバ関数
	HRESULT Init(void);		// 初期化
	HRESULT Uninit(void);	// 終了

	// 静的メンバ関数
	static CShaderManager *Create(void);	// 生成
	static HRESULT Release(CShaderManager *&prShaderManager);	// 破棄

private:
	// メンバ変数
	CBumpMap *m_pBumpMap;	// バンプマッピング
};

#endif	// _SHADERMANAGER_H_
